In [8]:
import pandas as pd

In [9]:
cwd()

NameError: name 'cwd' is not defined

In [10]:
df = pd.read_csv("weather_data.csv")
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [ ]:
df[2:5]

In [ ]:
df.columns

In [ ]:
df.event

In [ ]:
df[['event','day']]

In [ ]:
df['temperature'].max()

In [ ]:
df.describe()

In [ ]:
df[df.temperature>32]

In [ ]:
df.temperature.max()

In [ ]:
df['day'][df['temperature'] == df['temperature'].max()]

In [ ]:
df[['day','event']][df['temperature'] == df['temperature'].max()]

In [ ]:
df.set_index('day', inplace=True)

In [ ]:
df

In [ ]:
df.index

In [ ]:
df.set_index('event',inplace=True)

In [ ]:
df

In [ ]:
df.reset_index(inplace=True)

In [ ]:
df

In [11]:
df = pd.read_csv("Q1_Sales.csv")

In [14]:
df.head()

     Country Region Sales Person    Date of Purchase   Total  Quantity
0      India  North         John   5/21/2014 0:00:00  100000       567
1         US  North         Bill  10/25/2014 0:00:00  120000      3000
2         UK  North       Thomas   6/22/2012 0:00:00  140000       345
3  Australia   East         John    4/4/2017 0:00:00  160000      1000
4     Africa   East         Bill   9/24/2010 0:00:00  180000       123

In [15]:
columns_to_be_selected = ["Total", "Quantity", "Country"]

In [20]:
x=df[columns_to_be_selected]

In [26]:
df.iloc[0:3, -1]

0     567
1    3000
2     345
Name: Quantity, dtype: int64

In [27]:
row_index_to_select = [0, 1, 4, 5]
df.loc[row_index_to_select]

     Country Region Sales Person    Date of Purchase   Total  Quantity
0      India  North         John   5/21/2014 0:00:00  100000       567
1         US  North         Bill  10/25/2014 0:00:00  120000      3000
4     Africa   East         Bill   9/24/2010 0:00:00  180000       123
5  Singapore   East       Thomas   6/22/2015 0:00:00  200000      1000

In [39]:
df.iloc[row_index_to_select,-1]

0     567
1    3000
4     123
5    1000
Name: Quantity, dtype: int64

In [36]:
df[df["Total"]>20000000]

  Country Region Sales Person   Date of Purchase     Total  Quantity
8      US   West       Thomas  5/29/2010 0:00:00  26000000      1000

In [40]:
x=df[(df["Total"] > 200000) & (df["Country"] == "UK")]

In [41]:
x

   Country Region Sales Person   Date of Purchase   Total  Quantity
16      UK   West         Bill  7/24/2015 0:00:00  240000        90

In [45]:
type(x)

pandas.core.frame.DataFrame

In [46]:
df['Date of Purchase'].iloc[0]

'5/21/2014 0:00:00'

In [47]:
type(df['Date of Purchase'].iloc[0])

str

In [48]:
df['Date of Purchase'] = pd.to_datetime(df['Date of Purchase'])

In [49]:
type(df['Date of Purchase'].iloc[0])

pandas._libs.tslib.Timestamp

In [50]:
df['Date of Purchase'].iloc[0]

Timestamp('2014-05-21 00:00:00')

In [57]:
df['Date of Purchase'].dt.month
#df['Date of Purchase'].dt.year

0     2014
1     2014
2     2012
3     2017
4     2010
5     2015
6     2017
7     2018
8     2010
9     2013
10    2010
11    2015
12    2014
13    2010
14    2013
15    2017
16    2015
17    2011
18    2015
19    2015
Name: Date of Purchase, dtype: int64

In [58]:
df["Total"].sum()

30050000

In [60]:
df[["Total", "Quantity"]].mean()

Total       1502500.0
Quantity        977.9
dtype: float64

In [61]:
df[["Total", "Quantity"]].max()

Total       26000000
Quantity        7890
dtype: int64

In [62]:
df.groupby("Country").sum()

              Total  Quantity
Country
Africa       460000      1208
Australia    540000      1657
India        540000       857
Mylasia     1180000      8334
Singapore    510000      1977
UK           480000      1435
US         26340000      4090

In [63]:
df.groupby(["Country", "Region"])["Quantity"].sum()

Country    Region
Africa     East       123
           North     1085
Australia  East      1000
           North      567
           West        90
India      East        90
           North      567
           West       200
Mylasia    East       444
           West      7890
Singapore  East      1892
           North       85
UK         North     1345
           West        90
US         North     3000
           West      1090
Name: Quantity, dtype: int64

In [64]:
import numpy as np
df.pivot_table(index=["Country"], 
               columns=["Region"], 
               values=["Quantity"], 
               aggfunc=[np.sum])
#https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.pivot_table.html

               sum
          Quantity
Region        East   North    West
Country
Africa       123.0  1085.0     NaN
Australia   1000.0   567.0    90.0
India         90.0   567.0   200.0
Mylasia      444.0     NaN  7890.0
Singapore   1892.0    85.0     NaN
UK             NaN  1345.0    90.0
US             NaN  3000.0  1090.0